# YOLO11n + SSAM/CAAM 单目标裂缝检测配置
# 核心参数：单类别（裂缝）、轻量化尺度、插入SSAM/CAAM增强特征提取
nc: 1  # 类别数：裂缝（单目标）
scale: n  # 核心：指定默认使用的尺度（n/s/m/l/x任选），消除警告
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth_multiple, width_multiple, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# 模型结构：backbone + head（关键：SSAM/CAAM插入在C2f之后，Conv之前）
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0: 输入→64通道，步长2，下采样
  - [-1, 1, Conv, [128, 3, 2]] # 1: 64→128，步长2，下采样
  - [-1, 3, C2f, [128, True]]  # 2: 128→128，C2f残差块（3层）
  - [-1, 1, Conv, [256, 3, 2]] # 3: 128→256，步长2，下采样
  - [-1, 6, C2f, [256, True]]  # 4: 256→256，C2f残差块（6层）
  - [-1, 1, SSAM, [256, 4, 2, 0.1]]  # 5: 插入SSAM！参数：in_channels=256, groups=4, reduction_ratio=2, dropout=0.1
  - [-1, 1, Conv, [512, 3, 2]] # 6: 256→512，步长2，下采样
  - [-1, 6, C2f, [512, True]]  # 7: 512→512，C2f残差块（6层）
  - [-1, 1, CAAM, [512, 4, 0.1]]  # 8: 插入CAAM！参数：dim=512, squeeze_factor=4, dropout=0.1
  - [-1, 1, Conv, [1024, 3, 2]]  # 9: 512→1024，步长2，下采样
  - [-1, 3, C2f, [1024, True]] # 10: 1024→1024，C2f残差块（3层）
  - [-1, 1, SPPF, [1024, 5]]   # 11: 1024→1024，SPPF空间金字塔池化

head:
  # [from, number, module, args]
  - [-1, 1, Conv, [512, 1, 1]]  # 12: 1024→512，1x1卷积降维
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13: 上采样2倍
  - [[-1, 8], 1, Concat, [1]]   # 14: 拼接13层(512)和8层(512)→1024通道
  - [-1, 3, C2f, [512, False]]  # 15: 1024→512，C2f残差块（3层）

  - [-1, 1, Conv, [256, 1, 1]]  # 16: 512→256，1x1卷积降维
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17: 上采样2倍
  - [[-1, 5], 1, Concat, [1]]   # 18: 拼接17层(256)和5层(256)→512通道
  - [-1, 3, C2f, [256, False]]  # 19: 512→256，C2f残差块（3层）

  - [-1, 1, Conv, [256, 3, 2]]  # 20: 256→256，步长2，下采样
  - [[-1, 16], 1, Concat, [1]]  # 21: 拼接20层(256)和16层(256)→512通道
  - [-1, 3, C2f, [512, False]]  # 22: 512→512，C2f残差块（3层）

  - [-1, 1, Conv, [512, 3, 2]]  # 23: 512→512，步长2，下采样
  - [[-1, 12], 1, Concat, [1]]  # 24: 拼接23层(512)和12层(512)→1024通道
  - [-1, 3, C2f, [1024, False]] # 25: 1024→1024，C2f残差块（3层）

  # 检测头：YOLO11原生Detect层
  - [[19, 22, 25], 1, Detect, [nc]]  # 26: 检测头，输入3个尺度特征